var department_hash = {
  //文學院
  "101": "中文系",
  "103": "歷史系",
  "104": "哲學系",
  //教育學院
  "102": "教育系",
  //社科院
  "202": "政治系",
  "204": "社會系",
  "205": "財政系",
  "206": "公行系",
  "207": "地震系",
  "208": "經濟系",
  "209": "民族系",
  //國務院
  "203": "外交系",
  //商學院
  "301": "國貿系",
  "302": "金融系",
  "303": "會計系",
  "304": "統計系",
  "306": "資管系",
  "307": "財管系",
  "308": "風管系",
  //傳播學院
  "401": "新聞系",
  "402": "廣告系",
  "403": "廣電系",
  "404": "傳播學程",
  //外語學院
  "501": "英文系",
  "502": "阿語系",
  "504": "斯語系",
  "506": "日文系",
  "507": "韓文系",
  "508": "土語系",
  "509": "歐語學程",
  //法學院
  "601": "法律系",
  //理學院
  "701": "應數系",
  "702": "心理系",
  "703": "科科系",
//研究所
//文學院
  "151": "中文所",
  "153": "歷史所",
  "154": "哲學所",
  "155": "圖檔所",
  "156": "宗教所",
  "158": "台史所",
  "159": "台文所",
  "161": "華語文教學碩士學程",
  "912": "國文教學碩士在職專班",
  "913": "圖書資訊學術位碩士在職專班",
//教育學院
  "152": "教育所",
  "157": "幼教所",
  "171": "教政所",
  "911": "學校行政碩士在職專班",
//社科院
  "252": "政治所",
  "254": "社會所",
  "255": "財政所",
  "256": "公行所",
  "257": "地政所",
  "258": "經濟所",
  "259": "民族所",
  "261": "國發所",
  "262": "勞工所",
  "264": "社工所",
  "921": "行政管理碩士學程",
  "923": "地政學系碩士在職專班",
  "926": "亞太研究英語碩士學程",
  //國務院
  "253": "外交所",
  "260": "東亞所",
  "263": "俄研所",
  "981": "國家安全與大陸研究碩士在職專班",
  "922": "外交學系戰略與國際事務碩士在職專班",
  //商學院
  "351": "國貿所",
  "352": "金融所",
  "353": "會計所", 
  "354": "統計所",
  "355": "企管所",
  "356": "資管所",
  "357": "財管所",
  "358": "風管所",
  "359": "科管所",
  "361": "智財所",
  "934": "生科學程",
  "380": "商管專業學院碩士學程",
  "932": "經營管理碩士學程",
  "933": "國際經營管理英語碩士學程",
  //傳播學院
  "451": "新聞所",
  "452": "廣告所",
  "453": "廣電所",
  "461": "國際傳播學程",
  "462": "數位內容碩士學程",
  "941": "傳播學院碩士在職專班",
  //外語學院
  "551": "英文所",
  "554": "斯語所",
  "555": "語言所",
  "556": "日文所",
  "951": "英語教學碩士在職專班",
  "952": "歐洲語言文化學程碩士在職專班",
  //法學院
  "651": "法律所",
  "652": "法科所",
  "961": "法學院碩士在職專班",
  //理學院
  "751": "應數所",
  "752": "心理所",
  "753": "資科所",
  "754": "神科所",
  "755": "應物所",
  "971": "資科系碩士在職專班"
}
var student_id = prompt("Please enter your student id e.g. 99307023:","");
var department_id = (student_id[0]=="1") ? student_id.substring(3,6) : student_id.substring(2,5);
var department_name = (department_hash.hasOwnProperty(department_id)) ? 
                    department_hash[department_id] : "不要問";
jQuery(document).ready(function(){
    jQuery("#ans").html(department_name);
});
